[
    {
        "id": "older-viewer-cultural-natives",
        "name": "How To Win The 55+ Demographic Without Ageist Stereotypes?",
        "description": "Analyzes cultural wisdom and lived experience to create authentic connections with mature consumers by celebrating their value, not patronizing them",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Differentiate",
        "value": "Ensures campaigns resonate with older consumers by avoiding stereotypes and celebrating experience, improving brand loyalty and purchase intent in the most affluent demographic",
        "whoSearches": "Brand managers, Creative directors, Media planners, Account strategists, Product marketers targeting mature demographics",
        "whyNeeded": "Missed revenue opportunities in 55+ segment due to ageist stereotypes and misrepresentation in advertising",
        "pricing": "$2,000-$4,500",
        "speed": "45-60 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "older-viewer-cultural-natives.json"
    },
    {
        "id": "4c-model",
        "name": "Why Is My Campaign Failing?",
        "description": "Systematically identifies missing strategic elements using 4C framework to pinpoint exactly where campaigns lose effectiveness and how to fix them",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Prevents wasted marketing budget by highlighting gaps in strategy before launch or diagnosing underperforming campaigns with surgical precision",
        "whoSearches": "Brand strategists, CMOs, Strategic planners, Marketing directors, Brand managers with underperforming campaigns",
        "whyNeeded": "Incomplete strategies lead to wasted ad spend and missed ROI - boards demand systematic diagnosis not guesswork",
        "pricing": "$2,000-$4,500",
        "speed": "30-45 minutes",
        "marketUrgency": "MEDIUM",
        "rows": 4,
        "columns": 6,
        "file": "4c-model.json"
    },
    {
        "id": "competitor-steal-strategy",
        "name": "Why Are Competitors Stealing Our Customers?",
        "description": "Decodes competitor strategies to reveal exactly why they win customers and provides actionable counter-strategies to win them back",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Defend",
        "value": "Helps clients improve their campaigns and retain market share with competitive intelligence that boards can act on immediately",
        "whoSearches": "CMOs, Brand Managers losing market share, Product marketers, Strategic planners under board pressure",
        "whyNeeded": "Boards demand explanations for competitor success and actionable responses, not vague theories or excuses",
        "pricing": "$2,500-$5,000",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "competitor-steal-strategy.json"
    },
    {
        "id": "gen-z-trend-translator",
        "name": "How To Market To Gen-Z Without Looking Cringe",
        "description": "Translates youth culture signals and emerging trends into authentic brand messaging that Gen-Z respects instead of mocks online",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Differentiate",
        "value": "Ensures campaigns connect with younger demographics authentically, improving engagement and preventing viral embarrassment",
        "whoSearches": "Brand managers, Social media managers, Product marketers, Creative directors, Innovation teams",
        "whyNeeded": "Revenue declines in 18-25 segment due to brands trying too hard and getting roasted on TikTok",
        "pricing": "$1,500-$3,500",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "gen-z-trend-translator.json"
    },
    {
        "id": "brand-pyramid",
        "name": "Is Our Brand Building Actually Working?",
        "description": "Measures brand equity effectiveness using Brand Pyramid framework to show exactly what's working and what's wasting budget",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Provides measurable proof of brand value to justify marketing spend and optimize future investments with data boards trust",
        "whoSearches": "Brand managers, Marketing directors, Corporate strategists, Brand architects under scrutiny",
        "whyNeeded": "Boards demand proof of ROI for brand investments - 'awareness' is no longer enough justification",
        "pricing": "$2,500-$5,500",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "brand-pyramid.json"
    },
    {
        "id": "brand-key",
        "name": "Does This Campaign Actually Fit Our Brand?",
        "description": "Checks campaign messaging alignment with core brand strategy using Brand Key framework to prevent off-brand disasters",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Ensures campaigns are strategically aligned to maximize impact and prevent brand confusion that destroys equity",
        "whoSearches": "CPG brand managers, Agency strategists, Marketing directors, Brand architects reviewing campaigns",
        "whyNeeded": "Misaligned campaigns reduce brand credibility, confuse customers, and waste millions in ad spend",
        "pricing": "$1,800-$4,000",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 5,
        "columns": 6,
        "file": "brand-key.json"
    },
    {
        "id": "benefit-ladder",
        "name": "Why Isn't Our Message Emotionally Connecting?",
        "description": "Maps emotional progression using Benefit Ladder framework to transform functional messaging into emotional brand building",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Differentiate",
        "value": "Helps campaigns create stronger emotional connections with audiences that drive loyalty beyond rational features",
        "whoSearches": "Product managers, Creative directors, Brand strategists, CMOs frustrated with flat response",
        "whyNeeded": "Campaigns stuck at functional level fail to engage consumers emotionally and get ignored in market",
        "pricing": "$1,500-$3,500",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 4,
        "columns": 6,
        "file": "benefit-ladder.json"
    },
    {
        "id": "brand-house",
        "name": "Why Does Our Brand Feel Confusing?",
        "description": "Evaluates brand expression consistency across campaigns using Brand House framework to eliminate mixed signals",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Prevents brand confusion and strengthens recognition by ensuring every touchpoint reinforces the same brand truth",
        "whoSearches": "Brand architects, Corporate marketing teams, CMOs, Brand managers",
        "whyNeeded": "Inconsistent brand messaging confuses customers, reduces trust, and destroys years of brand building",
        "pricing": "$2,200-$4,800",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 5,
        "columns": 6,
        "file": "brand-house.json"
    },
    {
        "id": "golden-circle",
        "name": "Does Our Brand Purpose Actually Inspire Anyone?",
        "description": "Checks if campaigns communicate brand purpose effectively using Golden Circle framework to move beyond empty 'why' statements",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Differentiate",
        "value": "Ensures campaigns inspire and engage audiences by focusing on authentic 'Why' instead of just features and benefits",
        "whoSearches": "Purpose-driven marketers, Leadership coaches, Brand strategists, CMOs pressured for meaning",
        "whyNeeded": "Brands focusing only on 'What' commoditize themselves and limit emotional impact and premium pricing",
        "pricing": "$1,800-$4,200",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 4,
        "columns": 6,
        "file": "golden-circle.json"
    },
    {
        "id": "brand-archetype",
        "name": "Is Our Brand Personality Confusing Customers?",
        "description": "Evaluates whether campaigns reflect consistent brand personality using Brand Archetype framework to eliminate mixed signals",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Prevents personality confusion that destroys brand identity and ensures every campaign reinforces authentic character",
        "whoSearches": "Brand personality specialists, Creative strategists, Brand managers, CMOs",
        "whyNeeded": "Inconsistent archetype usage reduces brand clarity, confuses audiences, and destroys loyalty over time",
        "pricing": "$1,600-$3,800",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "brand-archetype.json"
    },
    {
        "id": "get-who-to-by",
        "name": "What Exactly Is This Campaign Supposed To Do?",
        "description": "Ensures campaigns have crystal-clear tactical objectives using GET/WHO/TO/BY framework to eliminate vague briefs",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Prevents wasted ad spend due to unclear campaign direction by defining exactly who does what by when",
        "whoSearches": "Performance marketers, Campaign managers, Brand strategists, Marketing directors tired of vague briefs",
        "whyNeeded": "Unclear objectives destroy campaign ROI, waste millions, and kill client confidence in agency partnerships",
        "pricing": "$1,400-$3,200",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 4,
        "columns": 6,
        "file": "get-who-to-by.json"
    },
    {
        "id": "aaker-brand-equity",
        "name": "How Do We Prove Brand Value To The Board?",
        "description": "Assesses brand strength and equity building using Aaker's Brand Equity framework with metrics boards actually understand",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Defend",
        "value": "Provides measurable proof of brand value for investment decisions using the most trusted brand equity model",
        "whoSearches": "Brand equity researchers, Corporate strategists, CMOs, Brand managers defending budgets",
        "whyNeeded": "Boards require validated frameworks to justify marketing budgets - anecdotes and 'awareness' don't cut it",
        "pricing": "$2,000-$4,600",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 4,
        "columns": 6,
        "file": "aaker-brand-equity.json"
    },
    {
        "id": "aida-conversion",
        "name": "Where Are We Losing Customers In The Funnel?",
        "description": "Analyzes campaign conversion at each stage using AIDA framework to identify exactly where prospects drop off",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Identifies leaks in the funnel to improve conversion rates and revenue without increasing ad spend",
        "whoSearches": "Direct response marketers, E-commerce managers, Brand strategists, Performance marketers",
        "whyNeeded": "Campaigns lose prospects at various stages due to unclear messaging, lowering ROI by 40-70%",
        "pricing": "$1,200-$2,800",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 4,
        "columns": 6,
        "file": "aida-conversion.json"
    },
    {
        "id": "crisis-proof-brand-messaging",
        "name": "Will This Ad Cause A PR Disaster?",
        "description": "Prevents PR disasters by analyzing messaging risk across cultural, social, and political dimensions before launch",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Defend",
        "value": "Protects brand reputation and prevents revenue loss from viral backlash that can destroy years of brand building",
        "whoSearches": "Legal teams, CMOs, Agency account directors, Brand strategists, Risk management",
        "whyNeeded": "Viral backlash can destroy years of brand building in 24 hours - prevention costs nothing compared to crisis",
        "pricing": "$3,000-$8,000",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "crisis-proof-brand-messaging.json"
    },
    {
        "id": "conversion-drop-off-forensics",
        "name": "Why Is Conversion Rate So Low?",
        "description": "Detects and fixes exact points where campaigns lose conversions through systematic forensic analysis",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Diagnose",
        "value": "Increases revenue by identifying and fixing campaign performance leaks that waste ad budget",
        "whoSearches": "Performance marketers, E-commerce directors, Brand strategists, Marketing directors under pressure",
        "whyNeeded": "Poor conversion rates waste ad spend, reduce income, and get marketers fired",
        "pricing": "$2,000-$4,500",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "conversion-drop-off-forensics.json"
    },
    {
        "id": "platform-specific-creative-optimization",
        "name": "Why Does This Creative Fail On Different Platforms?",
        "description": "Optimizes creative for each social media platform's unique algorithms, formats, and audience behaviors",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Differentiate",
        "value": "Maximizes engagement and ROI by platform-specific adjustments instead of using same creative everywhere",
        "whoSearches": "Social media managers, Creative directors, Brand strategists, Marketing directors",
        "whyNeeded": "Same creative performs 10x differently across channels due to platform-specific user behavior",
        "pricing": "$1,800-$4,000",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "platform-specific-creative-optimization.json"
    },
    {
        "id": "breakthrough-innovation-storytelling",
        "name": "How To Launch A New Product Without Flopping",
        "description": "Positions breakthrough innovations as revolutionary in the market using proven storytelling frameworks that drive adoption",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Disrupt",
        "value": "Prevents failed launches and accelerates product adoption by making innovation feel exciting not scary",
        "whoSearches": "Product marketers, Innovation teams, Startup founders, Brand strategists, CMOs with new launches",
        "whyNeeded": "Poor launch positioning leads to revenue loss and market failure - 95% of new products fail",
        "pricing": "$4,000-$10,000",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "breakthrough-innovation-storytelling.json"
    },
    {
        "id": "emotional-manipulation-ethics-scanner",
        "name": "Are We Being Manipulative Or Just Persuasive?",
        "description": "Checks campaigns for ethical boundaries and emotional manipulation risks that trigger consumer backlash",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Defend",
        "value": "Prevents consumer backlash and reputational damage by identifying manipulative tactics before they go live",
        "whoSearches": "Legal teams, Ethics officers, Brand safety managers, CMOs, Brand strategists",
        "whyNeeded": "Unethical messaging destroys consumer trust and long-term revenue in minutes on social media",
        "pricing": "$2,500-$6,000",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "emotional-manipulation-ethics-scanner.json"
    },
    {
        "id": "local-market-cultural-adaptation",
        "name": "Will This Campaign Work In [New Market]?",
        "description": "Ensures campaigns are culturally appropriate for each target market by identifying risks and opportunities before launch",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Defend",
        "value": "Prevents brand missteps and ensures successful global market entry by respecting local cultural nuances",
        "whoSearches": "Global brand managers, International marketing directors, Brand strategists, CMOs expanding markets",
        "whyNeeded": "Cultural insensitivity leads to market rejection, viral backlash, and catastrophic loss of revenue",
        "pricing": "$2,000-$5,500",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "local-market-cultural-adaptation.json"
    },
    {
        "id": "influencer-partnership-roi-predictor",
        "name": "Is This Influencer Worth The Money?",
        "description": "Analyzes influencer partnerships for genuine ROI potential by detecting fake followers and predicting campaign performance",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Defend",
        "value": "Avoids costly partnerships with fake influencers and maximizes marketing spend efficiency on real impact",
        "whoSearches": "Social media managers, Influencer marketing specialists, Brand strategists, Marketing directors",
        "whyNeeded": "Fake or poor-performing influencers waste large budgets delivering zero ROI and damaging brand credibility",
        "pricing": "$1,500-$3,800",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "influencer-partnership-roi-predictor.json"
    },
    {
        "id": "regulatory-compliance-creative-review",
        "name": "Will This Campaign Get Us Fined?",
        "description": "Checks campaigns for regulatory compliance across industries (pharma, finance, alcohol) to prevent legal violations",
        "category": "Agency, Advertiser, Achiever",
        "strategyCluster": "Defend",
        "value": "Prevents fines, legal issues, and reputational damage by ensuring campaigns meet all regulatory requirements",
        "whoSearches": "Legal departments, Compliance officers, Pharmaceutical marketers, Brand strategists in regulated industries",
        "whyNeeded": "Regulatory violations can lead to millions in fines, lawsuits, and permanent brand damage",
        "pricing": "$3,500-$8,500",
        "speed": "30-45 minutes",
        "marketUrgency": "HIGH",
        "rows": 6,
        "columns": 6,
        "file": "regulatory-compliance-creative-review.json"
    }
]